_Rarzrabotki/Rarus/USO2/Documents/УПН_ДоговорПоНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_ДоговорПоНедвижимости</Name>
			<BasedOn>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</xr:Item>
				<xr:Item>InformationRegister.УСОERP_СоответствиеДоговоровИДолей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервоначальногоПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПлатежей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговораБезРассрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРассрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыОперацийСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДляАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыДоговоровПоНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокВыплат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРассрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПроцентаРассрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплатыБезРассрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_ДоговорПоНедвижимости/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

// Заполнение графика платежей

&НаСервере
Процедура ЗаполнитьДокументПоБТИНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьДокументПоБТИ();
	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецПроцедуры

// Процедуры расчета

&НаКлиенте
Процедура РассчитатьСуммуРассрочки()
	
	Объект.СуммаРассрочки = Объект.ГрафикПлатежей.Итог("СуммаПроцентаРассрочки");
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДоговора()
	
	Объект.СуммаДоговора = Объект.СуммаДоговораБезРассрочки + Объект.СуммаРассрочки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДоговораБезРассрочки()
	
	Объект.СуммаДоговораБезРассрочки = Объект.ОбъектыНедвижимости.Итог("Сумма");

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПартнераСервер()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	
	Если Объект.Договор.Контрагент <> Объект.Контрагент ИЛИ Объект.Договор.Организация <> Объект.Организация Тогда
		Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	Если Параметры.Свойство("Основание") Тогда
		Если ТипЗнч(Параметры.Основание) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если  НЕ Параметры.Основание.УСОERP_ДоговорДолевогоСтроительства Тогда
				Отказ = Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДоступностьЭлементовСвязанныхСдоговоромАгента();
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ТекущаяДатаДокумента = Объект.Дата;
	ТекущаяВалюта = Объект.Валюта;
	ТекущийВидЦены = Объект.ВидЦены;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Контрагент = Объект.Контрагент;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуОбъектыНедвижимостиНаСервере(ВыбранноеЗначение)
	
	НоваяСтрока = Объект.ОбъектыНедвижимости.Добавить();
	НоваяСтрока.ОбъектНедвижимости = ВыбранноеЗначение;
	НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
	НоваяСтрока.СтавкаНДС = Объект.Договор.СтавкаНДС;
	НоваяСтрока.ОбщаяПлощадь = УПН_ОбщиеПроцедуры.ПолучитьОбщуюПлощадьПоОбъектуНедвижимости(ВыбранноеЗначение,?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	НоваяСтрока.Цена = УПН_ОбщиеПроцедуры.ПолучитьЦенуПоОбъектуНедвижимости(ВыбранноеЗначение,Объект.ВидЦены,Объект.ТипОперации,Объект.Валюта,?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	НоваяСтрока.Сумма = НоваяСтрока.ОбщаяПлощадь*НоваяСтрока.Цена;
	НоваяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НоваяСтрока.СтавкаНДС,Объект.ВидЦены.ЦенаВключаетНДС);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьДокументПоДаннымБТИ(Команда)
	
	ЗаполнитьДокументПоБТИНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	//УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОбъектовНедвижимости(Команда)
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе",Ложь);
	ОткрытьФорму("Справочник.АУН_ОбъектыНедвижимости.ФормаВыбора",ПараметрыПодбора,Элементы.ОбъектыНедвижимости,УникальныйИдентификатор,,,);
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	ПриИзмененииПартнераСервер();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТЧ 
&НаКлиенте
Процедура ОбъектыНедвижимостиСтавкаНДСПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ОбъектыНедвижимости.ТекущиеДанные;
	ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, ТекущаяСтрока.СтавкаНДС,Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДобавитьСтрокуОбъектыНедвижимостиНаСервере(ВыбранноеЗначение);
	ПересчитатьИтоговыеСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиПриИзменении(Элемент)
	  ПересчитатьИтоговыеСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоговыеСуммыДокумента()
	РассчитатьСуммуДоговораБезРассрочки();
	РассчитатьСуммуРассрочки();
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПлатежей(Команда)
	Если Объект.ГрафикПлатежей.Количество()>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьГрафикПлатежейИЗаполнить",ЭтотОбъект),"Табличная часть графика платежей будет очищена, продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьГрафикПлатежейКлиент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьГрафикПлатежейИЗаполнить(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ГрафикПлатежей.Очистить();
		ЗаполнитьГрафикПлатежейКлиент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПлатежейКлиент() 
	Если Объект.КоличествоПлатежей=0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Объект.КоличествоПлатежей";
		Сообщение.Текст = "Укажите количество платежей!";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	СуммаРазовогоПлатежа = Окр(Объект.СуммаДоговораБезРассрочки/Объект.КоличествоПлатежей,0);
	УчтеннаяСумма = 0;
	ОстатокВыплат = Объект.СуммаДоговораБезРассрочки;
	Для Смещение = 0 По Объект.КоличествоПлатежей-1 Цикл
		 НоваяСтрока = Объект.ГрафикПлатежей.Добавить();
		 НоваяСтрока.ДатаПлатежа = БюджетированиеКлиентСервер.ДобавитьИнтервал(Объект.ДатаПервоначальногоПлатежа, Объект.ПериодичностьОплаты, Смещение);
		 День = ДеньНедели(НоваяСтрока.ДатаПлатежа);
		 Если День>=6 Тогда
			НоваяСтрока.ДатаПлатежа = БюджетированиеКлиентСервер.ДобавитьИнтервал(НоваяСтрока.ДатаПлатежа, ПредопределенноеЗначение("Перечисление.Периодичность.День"), 8-День); 
		 КонецЕсли;
		 НоваяСтрока.СуммаВыплатыБезРассрочки = ?(Смещение=Объект.КоличествоПлатежей-1,Объект.СуммаДоговораБезРассрочки - УчтеннаяСумма,СуммаРазовогоПлатежа);
		 НоваяСтрока.ОстатокВыплат = ОстатокВыплат;
		 НоваяСтрока.СуммаВыплаты = НоваяСтрока.СуммаВыплатыБезРассрочки;
		 ОстатокВыплат = ОстатокВыплат - НоваяСтрока.СуммаВыплаты;
		 УчтеннаяСумма = СуммаРазовогоПлатежа + УчтеннаяСумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейПроцентРассрочкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ГрафикПлатежей.ТекущиеДанные;
	ТекущаяСтрока.СуммаПроцентаРассрочки = ТекущаяСтрока.ПроцентРассрочки*ТекущаяСтрока.СуммаВыплатыБезРассрочки/100;
	ТекущаяСтрока.СуммаВыплаты = ТекущаяСтрока.СуммаПроцентаРассрочки + ТекущаяСтрока.СуммаВыплатыБезРассрочки;
	ПересчитатьИтоговыеСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьГрафикПлатежей(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьГрафикПлатежейКлиент",ЭтотОбъект),"Очистить график платежей?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьГрафикПлатежейКлиент(КодВозврата,Параметры) Экспорт
	Если КодВозврата = КодВозвратаДиалога.Да Тогда
		Объект.ГрафикПлатежей.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭлементовСвязанныхСдоговоромАгента()
	ДоговорАгентаВыбран = ЗначениеЗаполнено(Объект.ДоговорАгента);
	Элементы.СуммаВознаграждения.ТолькоПросмотр = Не ДоговорАгентаВыбран;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДоговораАгентаНаСервере()
	Если ЗначениеЗаполнено(Объект.ДоговорАгента) Тогда	
		Объект.СуммаВознаграждения = Объект.ДоговорАгента.УСОERP_РазмерВознаграждения;
	КонецЕсли;
	ОбновитьДоступностьЭлементовСвязанныхСдоговоромАгента();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорАгентаПриИзменении(Элемент)
	ПриИзмененииДоговораАгентаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АгентПриИзменении(Элемент)
	ОбновитьДоступностьЭлементовСвязанныхСдоговоромАгента();
КонецПроцедуры

&НаСервере
Процедура ОбъектыНедвижимостиОбъектНедвижимостиПриИзмененииНаСервере(ИдСтроки) 	
		
	ТекСтрока = Объект.ОбъектыНедвижимости.НайтиПоИдентификатору(ИдСтроки);
	
	ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
	ТекСтрока.СтавкаНДС = Объект.Договор.СтавкаНДС;
	ТекСтрока.ОбщаяПлощадь = УПН_ОбщиеПроцедуры.ПолучитьОбщуюПлощадьПоОбъектуНедвижимости(ТекСтрока.ОбъектНедвижимости,?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	ТекСтрока.Цена = УПН_ОбщиеПроцедуры.ПолучитьЦенуПоОбъектуНедвижимости(ТекСтрока.ОбъектНедвижимости,Объект.ВидЦены,Объект.ТипОперации,Объект.Валюта,?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	ТекСтрока.Сумма = ТекСтрока.ОбщаяПлощадь*ТекСтрока.Цена;
	ТекСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекСтрока.Сумма, ТекСтрока.СтавкаНДС,Объект.ВидЦены.ЦенаВключаетНДС);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиОбъектНедвижимостиПриИзменении(Элемент)
	ОбъектыНедвижимостиОбъектНедвижимостиПриИзмененииНаСервере(Элементы.ОбъектыНедвижимости.ТекущиеДанные.ПолучитьИдентификатор());
	ПересчитатьИтоговыеСуммыДокумента();
КонецПроцедуры

#Область ОбработчикиКомандФормы  
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиЦенаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ОбъектыНедвижимости.ТекущиеДанные;
    ТекСтрока.Сумма = ТекСтрока.Цена*ТекСтрока.ОбщаяПлощадь;
	ТекСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекСтрока.Сумма, ТекСтрока.СтавкаНДС,Объект.ЦенаВключаетНДС);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиСуммаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ОбъектыНедвижимости.ТекущиеДанные;
	ТекСтрока.Цена = ?(ТекСТрока.ОбщаяПлощадь = 0,0,ТекСтрока.Сумма/ТекСтрока.ОбщаяПлощадь);
	ТекСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекСтрока.Сумма, ТекСтрока.СтавкаНДС,Объект.ЦенаВключаетНДС);

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НачалоДня(Объект.Дата) <> ТекущаяДатаДокумента И ЗначениеЗаполнено(ТекущаяДатаДокумента) И ЗначениеЗаполнено(Объект.ВидЦены) И Объект.ОбъектыНедвижимости.Количество() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДатаПриИзмененииПродолжение",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Перезаполнить цены?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТекущаяДатаДокумента = Объект.Дата;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура   ДатаПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да ТОгда
		ТекущаяДатаДокумента = Объект.Дата;
		ТекущийВидЦены = Объект.ВидЦены;
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ОбъектыНедвижимости Цикл		
		
		ОбъектыНедвижимостиОбъектНедвижимостиПриИзмененииНаСервере(СтрокаТЧ.ПолучитьИдентификатор());
		
	КонецЦикла;
	
	ПересчитатьИтоговыеСуммыДокумента();
	ТекущаяДатаДокумента = Объект.Дата;
	ТекущийВидЦены = Объект.ВидЦены;
	
КонецПроцедуры     

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)	
	
	Если Объект.Валюта <> ТекущаяВалюта И Объект.ОбъектыНедвижимости.Количество() Тогда 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВалютаПриИзмененииПродолжение",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Перезаполнить цены?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТекущаяВалюта = Объект.Валюта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура   ВалютаПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ТекущаяВалюта = Объект.Валюта;
		Возврат;
	КонецЕсли;
	
	ВалютаПриИзмененииСервер();	
	
	ПересчитатьИтоговыеСуммыДокумента();
	
	ТекущаяВалюта = Объект.Валюта;
	
КонецПроцедуры  

&НаСервере
Процедура ВалютаПриИзмененииСервер()
	
	КурсНовойВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, ТекущаяДатаДокумента);
	КурсСтаройВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ТекущаяВалюта, ТекущаяДатаДокумента);
	
	Для Каждого СтрокаТЧ ИЗ Объект.ОбъектыНедвижимости Цикл
		    		
		СтрокаТЧ.Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
		СтрокаТЧ.Цена,
		ТекущаяВалюта,Объект.Валюта,
		КурсСтаройВалюты.Курс,КурсНовойВалюты.Курс,
		КурсСтаройВалюты.Кратность,КурсНовойВалюты.Кратность);
		
		СтрокаТЧ.Сумма = СтрокаТЧ.Цена*СтрокаТЧ.ОбщаяПлощадь;
		СтрокаТЧ.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТЧ.Сумма, СтрокаТЧ.СтавкаНДС,Объект.ЦенаВключаетНДС);
		 		
	КонецЦикла;
	
КонецПроцедуры   

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЦенаВключаетНДСПриИзмененииПродолжение",ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,"Перезаполнить цены?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ОбъектыНедвижимости Цикл
		
		СтрокаТЧ.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТЧ.Сумма, СтрокаТЧ.СтавкаНДС,Объект.ЦенаВключаетНДС);
		
	КонецЦикла;
	
	ПересчитатьИтоговыеСуммыДокумента();
	
КонецПроцедуры 

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	
	Если Объект.ВидЦены <> ТекущийВидЦены И ЗначениеЗаполнено(ТекущийВидЦены) И Объект.ОбъектыНедвижимости.Количество() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДатаПриИзмененииПродолжение",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Перезаполнить цены?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТекущийВидЦены = Объект.ВидЦены;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Договор.СтавкаНДС) Тогда
		
		Для Каждого СтрокаТЧ ИЗ Объект.ОбъектыНедвижимости Цикл
			
			СтрокаТЧ.СтавкаНДС = Объект.Договор.СтавкаНДС;
			СтрокаТЧ.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТЧ.Сумма, СтрокаТЧ.СтавкаНДС,Объект.ЦенаВключаетНДС);
			
			
		КонецЦикла;  		
		
	КонецЕсли;
	
	Объект.ВидЦены = Объект.Договор.УСОERP_ТипЦены;
	Объект.ЦенаВключаетНДС = Объект.ВидЦены.ЦенаВключаетНДС;
	ТекущийВидЦены = Объект.ВидЦены;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
	ДатаПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
КонецПроцедуры

#КонецОбласти
